In [49]:
import numpy as np
import pandas as pd

In [50]:
dict1 = {
    "name":['arshaq', 'bilal', 'hashir', 'ahmed'],
    "marks":[91, 92, 75, 83],
    "city":['islamabad', 'karachi', 'peshawar', 'multan'],    
}

In [51]:
df = pd.DataFrame(dict1)

In [52]:
df

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi
2  hashir     75   peshawar
3   ahmed     83     multan

In [53]:
df.to_csv('friends.csv')

In [54]:
df.to_csv('friends_without_index.csv', index=False)

In [55]:
df.head(2)

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi

In [56]:
df.tail(2)

     name  marks      city
2  hashir     75  peshawar
3   ahmed     83    multan

In [57]:
df.describe()

           marks
count   4.000000
mean   85.250000
std     7.932003
min    75.000000
25%    81.000000
50%    87.000000
75%    91.250000
max    92.000000

In [58]:
train = pd.read_csv('train.csv')

In [59]:
train

   Unnamed: 0  Train No  Speed       city
0           0       122     50  islamabad
1           1      1243     92    karachi
2           2     21344     75   peshawar
3           3      2134     75     multan

In [60]:
train['Speed'][0] = 50

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\185416197.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  train['Speed'][0] = 50
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\185416197.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 50

In [61]:
train

   Unnamed: 0  Train No  Speed       city
0           0       122     50  islamabad
1           1      1243     92    karachi
2           2     21344     75   peshawar
3           3      2134     75     multan

In [62]:
train.to_csv('train.csv')

In [63]:
train.index = ['first', 'second', 'third', 'fourth']

In [64]:
train

        Unnamed: 0  Train No  Speed       city
first            0       122     50  islamabad
second           1      1243     92    karachi
third            2     21344     75   peshawar
fourth           3      2134     75     multan

### Pandas has two types of data structures:

1. Series: one dimensional array with indexes, single column or row of data in a Dataframe, holds any one type of data.
2. Dataframe: tabular spreadsheet like structure representing rows each of which contains one or multiple columns

In [69]:
ser = pd.Series(np.random.random(34))

In [71]:
type(ser)

pandas.core.series.Series

In [73]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [85]:
newdf.head()

          0         1         2         3         4
0  0.023828  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896
3  0.547367  0.108417  0.404601  0.403412  0.538661
4  0.836053  0.201772  0.108757  0.270906  0.759296

In [80]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.509105    0.508876    0.524817    0.493121    0.528798
std      0.274763    0.288200    0.293471    0.280277    0.294854
min      0.000535    0.000620    0.001463    0.001161    0.003441
25%      0.258706    0.261773    0.275267    0.271832    0.286588
50%      0.522229    0.503660    0.545944    0.482314    0.528814
75%      0.725740    0.770216    0.774323    0.730249    0.798240
max      0.999928    0.994592    0.999162    0.998438    0.999160

In [84]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [94]:
newdf[0][0] = 0.3

In [96]:
newdf.head()

          0         1         2         3         4
0       0.3  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896
3  0.547367  0.108417  0.404601  0.403412  0.538661
4  0.836053  0.201772  0.108757  0.270906  0.759296

In [91]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [92]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [97]:
newdf.to_numpy()

array([[0.3, 0.9042010990440608, 0.33166756118098584, 0.1465789608016298,
        0.2684604143881989],
       [0.17329153268668973, 0.8329459381648489, 0.5219403038793013,
        0.5444443282426483, 0.7325471025622962],
       [0.981816832971784, 0.8786259004732705, 0.004162489974553596,
        0.5591912839149537, 0.15489553604220985],
       ...,
       [0.6508853750241859, 0.4059473669830441, 0.3838371325393547,
        0.47312094103684943, 0.7297773481102873],
       [0.7794502297094101, 0.8615314653908358, 0.728794492682501,
        0.7278829369907079, 0.6404277264969441],
       [0.8550705932089342, 0.7642931868098696, 0.27505742399216293,
        0.02011781283642, 0.9351631314670408]], dtype=object)

In [98]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.173292,0.981817,0.547367,0.836053,0.541217,0.900185,0.518188,0.702306,0.635621,...,0.712713,0.049848,0.819738,0.893967,0.929721,0.422658,0.491349,0.650885,0.77945,0.855071
1,0.904201,0.832946,0.878626,0.108417,0.201772,0.379967,0.00062,0.908761,0.708663,0.037049,...,0.199413,0.59795,0.01356,0.079616,0.263574,0.790706,0.457739,0.405947,0.861531,0.764293
2,0.331668,0.52194,0.004162,0.404601,0.108757,0.107037,0.902252,0.122534,0.09947,0.691533,...,0.599133,0.022984,0.356197,0.874071,0.599346,0.300712,0.229694,0.383837,0.728794,0.275057
3,0.146579,0.544444,0.559191,0.403412,0.270906,0.486203,0.584585,0.683278,0.354349,0.255759,...,0.126559,0.617576,0.005074,0.576956,0.888299,0.577841,0.828881,0.473121,0.727883,0.020118
4,0.26846,0.732547,0.154896,0.538661,0.759296,0.873654,0.916365,0.263863,0.934097,0.942757,...,0.953468,0.475496,0.829481,0.237402,0.368081,0.260319,0.670339,0.729777,0.640428,0.935163

In [100]:
newdf.head()

          0         1         2         3         4
0       0.3  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896
3  0.547367  0.108417  0.404601  0.403412  0.538661
4  0.836053  0.201772  0.108757  0.270906  0.759296

In [110]:
newdf.sort_index(axis=0, ascending=False).head()

            0         1         2         3         4
333  0.855071  0.764293  0.275057  0.020118  0.935163
332   0.77945  0.861531  0.728794  0.727883  0.640428
331  0.650885  0.405947  0.383837  0.473121  0.729777
330  0.491349  0.457739  0.229694  0.828881  0.670339
329  0.422658  0.790706  0.300712  0.577841  0.260319

In [112]:
newdf.sort_index(axis=1, ascending=False).head()

          4         3         2         1         0
0  0.268460  0.146579  0.331668  0.904201       0.3
1  0.732547  0.544444  0.521940  0.832946  0.173292
2  0.154896  0.559191  0.004162  0.878626  0.981817
3  0.538661  0.403412  0.404601  0.108417  0.547367
4  0.759296  0.270906  0.108757  0.201772  0.836053

In [115]:
type(newdf[0])

pandas.core.series.Series

In [113]:
newdf.head()

          0         1         2         3         4
0       0.3  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896
3  0.547367  0.108417  0.404601  0.403412  0.538661
4  0.836053  0.201772  0.108757  0.270906  0.759296

In [117]:
newdf2 = newdf       #pointer to newdf, not another copy, it just points to the same memory location that has newdf

In [118]:
newdf2[0][0] = 4942

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\1726519269.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 4942

In [119]:
newdf

            0         1         2         3         4
0        4942  0.904201  0.331668  0.146579  0.268460
1    0.173292  0.832946  0.521940  0.544444  0.732547
2    0.981817  0.878626  0.004162  0.559191  0.154896
3    0.547367  0.108417  0.404601  0.403412  0.538661
4    0.836053  0.201772  0.108757  0.270906  0.759296
..        ...       ...       ...       ...       ...
329  0.422658  0.790706  0.300712  0.577841  0.260319
330  0.491349  0.457739  0.229694  0.828881  0.670339
331  0.650885  0.405947  0.383837  0.473121  0.729777
332   0.77945  0.861531  0.728794  0.727883  0.640428
333  0.855071  0.764293  0.275057  0.020118  0.935163

[334 rows x 5 columns]

In [120]:
newdf2 = newdf[:]         #makes a seperate copy of newdf and stores it in newdf2

In [121]:
newdf2 = newdf.copy()     #makes a seperate copy of newdf and stores it in newdf2

In [122]:
newdf2[0][0] = 21321

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\461067651.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 21321
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\461067651.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 21321

In [123]:
newdf

            0         1         2         3         4
0        4942  0.904201  0.331668  0.146579  0.268460
1    0.173292  0.832946  0.521940  0.544444  0.732547
2    0.981817  0.878626  0.004162  0.559191  0.154896
3    0.547367  0.108417  0.404601  0.403412  0.538661
4    0.836053  0.201772  0.108757  0.270906  0.759296
..        ...       ...       ...       ...       ...
329  0.422658  0.790706  0.300712  0.577841  0.260319
330  0.491349  0.457739  0.229694  0.828881  0.670339
331  0.650885  0.405947  0.383837  0.473121  0.729777
332   0.77945  0.861531  0.728794  0.727883  0.640428
333  0.855071  0.764293  0.275057  0.020118  0.935163

[334 rows x 5 columns]

In [124]:
newdf2

            0         1         2         3         4
0       21321  0.904201  0.331668  0.146579  0.268460
1    0.173292  0.832946  0.521940  0.544444  0.732547
2    0.981817  0.878626  0.004162  0.559191  0.154896
3    0.547367  0.108417  0.404601  0.403412  0.538661
4    0.836053  0.201772  0.108757  0.270906  0.759296
..        ...       ...       ...       ...       ...
329  0.422658  0.790706  0.300712  0.577841  0.260319
330  0.491349  0.457739  0.229694  0.828881  0.670339
331  0.650885  0.405947  0.383837  0.473121  0.729777
332   0.77945  0.861531  0.728794  0.727883  0.640428
333  0.855071  0.764293  0.275057  0.020118  0.935163

[334 rows x 5 columns]

In [125]:
newdf.head(2)

          0         1         2         3         4
0      4942  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547

In [128]:
newdf.columns = list("ABCDE")

In [130]:
newdf.head(2)

          A         B         C         D         E
0      4942  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547

In [131]:
newdf.loc[0,'A'] = 3425

In [132]:
newdf

            A         B         C         D         E
0        3425  0.904201  0.331668  0.146579  0.268460
1    0.173292  0.832946  0.521940  0.544444  0.732547
2    0.981817  0.878626  0.004162  0.559191  0.154896
3    0.547367  0.108417  0.404601  0.403412  0.538661
4    0.836053  0.201772  0.108757  0.270906  0.759296
..        ...       ...       ...       ...       ...
329  0.422658  0.790706  0.300712  0.577841  0.260319
330  0.491349  0.457739  0.229694  0.828881  0.670339
331  0.650885  0.405947  0.383837  0.473121  0.729777
332   0.77945  0.861531  0.728794  0.727883  0.640428
333  0.855071  0.764293  0.275057  0.020118  0.935163

[334 rows x 5 columns]

In [138]:
newdf.loc[0,'A'] = 8424

In [140]:
newdf.head(2)

          A         B         C         D         E
0      8424  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547

In [165]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.521940  0.544444
2  0.004162  0.559191

In [142]:
newdf.loc[:, ['C', 'D']]

            C         D
0    0.331668  0.146579
1    0.521940  0.544444
2    0.004162  0.559191
3    0.404601  0.403412
4    0.108757  0.270906
..        ...       ...
329  0.300712  0.577841
330  0.229694  0.828881
331  0.383837  0.473121
332  0.728794  0.727883
333  0.275057  0.020118

[334 rows x 2 columns]

In [143]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896

In [156]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
1    0.173292  0.832946  0.521940  0.544444  0.732547
18   0.146666  0.334861  0.442642  0.188870  0.968896
23    0.12827  0.206472  0.821302  0.920159  0.192111
25   0.062134  0.637314  0.574946  0.232904  0.429994
27   0.135327  0.444142  0.692709  0.932120  0.270002
..        ...       ...       ...       ...       ...
310  0.243156  0.393360  0.183633  0.494660  0.730207
313  0.132769  0.232260  0.114097  0.896542  0.906212
314  0.141296  0.800142  0.982821  0.946855  0.676435
315  0.194883  0.759952  0.700336  0.112654  0.253646
316  0.075517  0.867320  0.681305  0.726111  0.699163

[82 rows x 5 columns]

In [158]:
newdf.head(2)

          A         B         C         D         E
0      8424  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547

In [168]:
newdf.loc[0,'E']

np.float64(0.2684604143881989)

In [161]:
newdf.iloc[0,4]

np.float64(0.2684604143881989)

In [162]:
newdf.iloc[[0,5],[1,2]]

          B         C
0  0.904201  0.331668
5  0.379967  0.107037

In [169]:
newdf.head(3)

          A         B         C         D         E
0      8424  0.904201  0.331668  0.146579  0.268460
1  0.173292  0.832946  0.521940  0.544444  0.732547
2  0.981817  0.878626  0.004162  0.559191  0.154896

In [170]:
newdf.drop([0])

            A         B         C         D         E
1    0.173292  0.832946  0.521940  0.544444  0.732547
2    0.981817  0.878626  0.004162  0.559191  0.154896
3    0.547367  0.108417  0.404601  0.403412  0.538661
4    0.836053  0.201772  0.108757  0.270906  0.759296
5    0.541217  0.379967  0.107037  0.486203  0.873654
..        ...       ...       ...       ...       ...
329  0.422658  0.790706  0.300712  0.577841  0.260319
330  0.491349  0.457739  0.229694  0.828881  0.670339
331  0.650885  0.405947  0.383837  0.473121  0.729777
332   0.77945  0.861531  0.728794  0.727883  0.640428
333  0.855071  0.764293  0.275057  0.020118  0.935163

[333 rows x 5 columns]

In [178]:
newdf.drop([1,5], axis = 0, inplace = True)        #inplace modifies original dataframe

In [179]:
newdf

            B         D         E
0    0.904201  0.146579  0.268460
2    0.878626  0.559191  0.154896
3    0.108417  0.403412  0.538661
4    0.201772  0.270906  0.759296
6    0.000620  0.584585  0.916365
..        ...       ...       ...
329  0.790706  0.577841  0.260319
330  0.457739  0.828881  0.670339
331  0.405947  0.473121  0.729777
332  0.861531  0.727883  0.640428
333  0.764293  0.020118  0.935163

[332 rows x 3 columns]

In [180]:
newdf.head(3)

          B         D         E
0  0.904201  0.146579  0.268460
2  0.878626  0.559191  0.154896
3  0.108417  0.403412  0.538661

In [186]:
newdf.reset_index(drop = True, inplace = True)

In [188]:
newdf.head(3)

          B         D         E
0  0.904201  0.146579  0.268460
1  0.878626  0.559191  0.154896
2  0.108417  0.403412  0.538661

In [189]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [296]:
newdf.loc[:, ['B']] = None

In [327]:
newdf.iloc[np.arange(0,2), np.arange(0,2)] = 45

In [328]:
newdf

        B     D     E
0      45  45.0  32.0
1      45  45.0  32.0
2      56  56.0  71.0
3      56  56.0  71.0
4      56  56.0  71.0
..    ...   ...   ...
327  None  56.0   7.0
328  None  56.0   7.0
329  None  56.0   7.0
330  None  56.0   7.0
331  None  56.0   7.0

[332 rows x 3 columns]

In [214]:
newdf.loc[:, ['B', 'D']] = 56

In [215]:
newdf.head(4)

    B     D         E
0  56  56.0  0.268460
1  56  56.0  0.154896
2  56  56.0  0.538661
3  56  56.0  0.759296

In [203]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [231]:
df = pd.DataFrame(
    { "name": ['Alfred', 'Batman', 'Alfred'],
      "toy": [np.nan, 'Batmobile', 'Bullwhip'],  
      "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]
    })

In [232]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [230]:
df.dropna(how='all', axis=1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [238]:
df.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [240]:
df.shape

(3, 3)

In [242]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [243]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [247]:
df['toy'].value_counts(dropna=False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [250]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [251]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [288]:
data = pd.read_excel('data.xlsx', sheet_name='sheet1')

In [289]:
data

   Train No  Speed       city
0        21     98  islamabad
1        32     23    karachi
2        53     42   peshawar
3       435     54     multan

In [290]:
data.iloc[0,0] = 34

In [291]:
data

   Train No  Speed       city
0        34     98  islamabad
1        32     23    karachi
2        53     42   peshawar
3       435     54     multan

In [292]:
data2 = pd.read_excel('data.xlsx', sheet_name='sheet2')

In [293]:
data2

   Train Nos2  Speeds2     citys2
0          34       84  islamabad
1          52       32    karachi
2          87       98   peshawar
3         543       67     multan

In [294]:
with pd.ExcelWriter('output3.xlsx') as writer:
    data.to_excel(writer, sheet_name='sheet1')
    data2.to_excel(writer, sheet_name='sheet2')

In [253]:
#create a dataframe which contains only integers with 3 rows and 3 columns
#run following dataframe methods on them:

#describe(), mean(), corr(), count(), max(), min(), median(), std()

In [329]:
dict1 = {
    "id" : [10,20,30],
    "price" : [150, 275, 425],
    "discount" : [30, 15, 45] 
}

In [330]:
df = pd.DataFrame(dict1)

In [331]:
df

   id  price  discount
0  10    150        30
1  20    275        15
2  30    425        45

In [332]:
df.describe()

         id       price  discount
count   3.0    3.000000       3.0
mean   20.0  283.333333      30.0
std    10.0  137.689264      15.0
min    10.0  150.000000      15.0
25%    15.0  212.500000      22.5
50%    20.0  275.000000      30.0
75%    25.0  350.000000      37.5
max    30.0  425.000000      45.0

In [337]:
df.mean()

id           20.000000
price       283.333333
discount     30.000000
dtype: float64

In [338]:
df.corr()

                id     price  discount
id        1.000000  0.998625  0.500000
price     0.998625  1.000000  0.544705
discount  0.500000  0.544705  1.000000

In [348]:
df.loc[0,['price']] = 750

In [349]:
df

   id  price  discount
0  10  750.0        30
1  20  275.0        15
2  30  425.0        45

In [350]:
df.count()

id          3
price       3
discount    3
dtype: int64

In [353]:
df.max(axis=0)

id           30.0
price       750.0
discount     45.0
dtype: float64

In [354]:
df.median()

id           20.0
price       425.0
discount     30.0
dtype: float64

In [355]:
df.std()

id           10.000000
price       242.813371
discount     15.000000
dtype: float64

In [356]:
df

   id  price  discount
0  10  750.0        30
1  20  275.0        15
2  30  425.0        45

In [357]:
df.drop([1], axis=0)

   id  price  discount
0  10  750.0        30
2  30  425.0        45

In [358]:
df

   id  price  discount
0  10  750.0        30
1  20  275.0        15
2  30  425.0        45

In [364]:
df.drop([1], axis=0, inplace=True)

In [365]:
df

   id  price  discount
0  10  750.0        30
2  30  425.0        45